# TopographySurface Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SiteSubRegion..::..TopographySurface Property
SiteSubRegion Class See Also
---
The TopographySurface element which this SiteSubRegion represents.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public TopographySurface TopographySurface { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TopographySurface As TopographySurface
	Get
```

Visual C++
---
```text
public:
property TopographySurface^ TopographySurface {
	TopographySurface^ get ();
}
```

# See Also
SiteSubRegion Class
Autodesk.Revit.DB.Architecture Namespace